RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7200.c
/***************************************************************************//**
* \file cyhal_triggers_xmc7200.c
*
* \brief
* XMC7200 family HAL triggers header
*
********************************************************************************
* \copyright
* (c) (2016-2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device_headers.h"
#include "cyhal_hw_types.h"

#ifdef CY_DEVICE_TVIIBH8M
#include "triggers/cyhal_triggers_xmc7200.h"

const uint16_t cyhal_sources_per_mux[27] =
{
    96, 77, 127, 7, 103, 168, 112, 69, 12, 16, 239, 178, 198, 15, 96, 22, 2, 15, 6, 96, 96, 5, 5, 20, 2, 2, 2,
};

const bool cyhal_is_mux_1to1[27] =
{
    false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, true, true, true, true, true, true, true, true,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux0_sources[96] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT17,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT18,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT20,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT21,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT23,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT24,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT25,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT26,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT27,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT28,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT29,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT30,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT31,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT7,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT4,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT4,
    _CYHAL_TRIGGER_FLEXRAY0_TR_TINT0_OUT,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT0,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT1,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT2,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT3,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT4,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT5,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT6,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT7,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT8,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT9,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT10,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT11,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT12,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT13,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT14,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT15,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT16,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT17,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT18,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT19,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT20,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT21,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT22,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT23,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT0,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT1,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT2,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT3,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux1_sources[77] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0256,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0257,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0258,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0512,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0513,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0514,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT03,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT04,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT05,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT06,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT07,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT08,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT09,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT010,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT011,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT012,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT013,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT014,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT015,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT016,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT017,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT018,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT019,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT020,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT021,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT022,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT023,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT024,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT025,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT026,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT027,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT028,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT029,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0256,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0257,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0258,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0259,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0260,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0261,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0262,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0263,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0264,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0265,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0266,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0267,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0512,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0513,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0514,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0515,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0516,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0517,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0518,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0519,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0520,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0521,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0522,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0523,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0524,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT0,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT1,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT2,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT3,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT4,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT5,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT1,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT0,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT1,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT2,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT3,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux2_sources[127] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT17,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT18,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT20,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT21,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT23,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT24,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT25,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT26,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT27,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT28,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT29,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT30,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT31,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT030,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT031,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT032,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT033,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT034,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT035,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT036,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT037,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT038,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT039,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT040,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT041,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT042,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT043,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT044,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT045,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT046,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT047,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT048,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT049,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT050,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT051,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT052,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT053,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT054,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT055,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT056,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT057,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT058,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT059,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT060,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT061,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT062,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT063,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT064,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT065,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT066,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT067,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT068,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT069,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT070,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT071,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT072,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT073,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT074,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT075,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT076,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT077,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT078,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT079,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT080,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT081,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT082,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT083,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT24,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT25,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT26,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT27,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT28,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT29,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT30,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT31,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT32,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT33,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT34,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT35,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT36,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT37,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT38,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT39,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT40,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT41,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT42,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT43,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT44,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT45,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT46,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT47,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux3_sources[7] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0256,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0257,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0258,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux4_sources[103] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT17,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT18,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT20,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT21,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT23,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT24,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT25,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT26,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT27,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT28,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT29,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT30,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT31,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT7,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0256,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0257,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0258,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0512,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0513,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0514,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT03,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT04,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT05,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT06,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT07,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT08,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT09,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT010,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT011,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT012,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT013,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT014,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT015,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0256,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0257,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0258,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0259,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0260,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0261,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0512,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0513,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0514,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0515,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0516,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0517,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0518,
    _CYHAL_TRIGGER_SMIF0_TR_TX_REQ,
    _CYHAL_TRIGGER_SMIF0_TR_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS2_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS2_TR_I2S_RX_REQ,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux5_sources[168] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0256,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0257,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0258,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0512,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0513,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0514,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT03,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT04,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT05,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT06,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT07,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT08,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT09,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT010,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT011,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT012,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT013,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT014,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT015,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT016,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT017,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT018,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT019,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT020,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT021,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT022,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT023,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT024,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT025,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT026,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT027,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT028,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT029,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT030,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT031,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT032,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT033,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT034,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT035,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT036,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT037,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT038,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT039,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT040,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT041,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT042,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT043,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT044,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT045,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT046,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT047,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT048,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT049,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT050,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT051,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT052,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT053,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT054,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT055,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT056,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT057,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT058,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT059,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT060,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT061,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT062,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT063,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT064,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT065,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT066,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT067,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT068,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT069,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT070,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT071,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT072,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT073,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT074,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT075,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT076,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT077,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT078,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT079,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT080,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT081,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT082,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT083,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0256,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0257,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0258,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0259,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0260,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0261,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0262,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0263,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0264,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0265,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0266,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0267,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0512,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0513,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0514,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0515,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0516,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0517,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0518,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0519,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0520,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0521,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0522,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0523,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0524,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ0,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ1,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ2,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ3,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ4,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO00,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO01,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO02,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO03,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO04,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO10,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO11,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO12,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO13,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO14,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ0,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ1,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ2,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ3,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ4,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO00,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO01,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO02,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO03,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO04,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO10,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO11,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO12,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO13,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO14,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT4,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT4,
    _CYHAL_TRIGGER_FLEXRAY0_TR_TINT0_OUT,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT4,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT5,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT6,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT7,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT8,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT9,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT10,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT11,
};

