RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7200.c
const _cyhal_trigger_source_xmc7200_t cyhal_mux6_sources[112] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT10,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT11,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT12,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT13,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT14,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT15,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT16,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT17,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT18,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT19,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT110,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT111,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT112,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT113,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT114,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT115,
    _CYHAL_TRIGGER_SCB0_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB1_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB2_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB3_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB4_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB5_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB6_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB7_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB8_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB9_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB10_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_FLEXRAY0_TR_IBF_OUT,
    _CYHAL_TRIGGER_FLEXRAY0_TR_OBF_OUT,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT0,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT1,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT2,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT3,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT4,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT5,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT0,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT1,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT2,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT3,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT4,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT5,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT6,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT7,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT8,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT9,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT10,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT11,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT12,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT13,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT14,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT15,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT16,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT17,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT18,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT19,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT20,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT21,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT22,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT23,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT24,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT25,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT26,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT27,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT28,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT29,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT30,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT31,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT32,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT33,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT34,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT35,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT36,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT37,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT38,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT39,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT40,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT41,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT42,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT43,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT44,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT45,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT46,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT47,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT0,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT1,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT2,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT3,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux7_sources[69] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT17,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT18,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT20,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT21,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT23,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT24,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT25,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT26,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT27,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT28,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT29,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT30,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT31,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0256,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0257,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0258,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0259,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0260,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0261,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0262,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0263,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0264,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0265,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0266,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0267,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0512,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0513,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0514,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0515,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0516,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0517,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0518,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0519,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0520,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0521,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0522,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0523,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT0524,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT0,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT1,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT2,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT3,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT4,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT5,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT6,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT7,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT12,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT13,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT14,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux8_sources[12] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT4,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT4,
    _CYHAL_TRIGGER_FLEXRAY0_TR_TINT0_OUT,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux9_sources[16] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT4,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux10_sources[239] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT17,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT18,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT20,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT21,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT23,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT24,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT25,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT26,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT27,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT28,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT29,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT30,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT31,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT32,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT33,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT34,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT35,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT36,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT37,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT38,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT39,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT40,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT41,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT42,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT43,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT44,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT45,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT46,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT47,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT48,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT49,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT50,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT51,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT52,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT53,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT54,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT55,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT56,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT57,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT58,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT59,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT60,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT61,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT62,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT63,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT64,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT65,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT66,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT67,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT68,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT69,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT70,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT71,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT72,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT73,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT74,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT75,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT76,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT77,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT78,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT79,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT80,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT81,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT82,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT83,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT84,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT85,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT86,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT87,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT88,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT89,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT90,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT91,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT92,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT93,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT94,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT95,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT96,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT97,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT98,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT99,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT100,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT101,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT102,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT103,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT104,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT105,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT106,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT107,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT108,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT109,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT110,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT111,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT112,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT113,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT114,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT115,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT116,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT117,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT118,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT119,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT120,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT121,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT122,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT123,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT124,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT125,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT126,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT127,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT128,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT129,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT130,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT131,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT132,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT133,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT134,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT135,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT136,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT137,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT138,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT139,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT140,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT141,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT142,
    _CYHAL_TRIGGER_SCB0_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB1_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB2_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB3_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB4_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB5_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB6_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB7_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB8_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB9_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB10_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ0,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ1,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ2,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ3,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ4,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO00,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO01,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO02,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO03,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO04,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO10,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO11,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO12,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO13,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO14,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT4,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ0,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ1,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ2,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ3,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ4,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO00,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO01,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO02,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO03,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO04,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO10,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO11,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO12,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO13,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO14,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT4,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT0,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT1,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT2,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT3,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT0,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT1,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT2,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT3,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT4,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT5,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT6,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT7,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT8,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT9,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT10,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT11,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT12,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT13,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT14,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT15,
};

