RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7200.c
const _cyhal_trigger_source_xmc7200_t cyhal_mux14_sources[96] =
{
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE0,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE1,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE2,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE3,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE4,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE5,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE6,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE7,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE8,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE9,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE10,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE11,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE12,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE13,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE14,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE15,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE16,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE17,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE18,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE19,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE20,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE21,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE22,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE23,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE24,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE25,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE26,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE27,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE28,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE29,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE30,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE31,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE32,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE33,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE34,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE35,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE36,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE37,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE38,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE39,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE40,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE41,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE42,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE43,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE44,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE45,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE46,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE47,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE48,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE49,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE50,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE51,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE52,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE53,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE54,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE55,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE56,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE57,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE58,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE59,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE60,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE61,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE62,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE63,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE64,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE65,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE66,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE67,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE68,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE69,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE70,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE71,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE72,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE73,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE74,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE75,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE76,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE77,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE78,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE79,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE80,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE81,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE82,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE83,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE84,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE85,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE86,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE87,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE88,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE89,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE90,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE91,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE92,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE93,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE94,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE95,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux15_sources[22] =
{
    _CYHAL_TRIGGER_SCB0_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_RX_REQ,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux16_sources[2] =
{
    _CYHAL_TRIGGER_SMIF0_TR_TX_REQ,
    _CYHAL_TRIGGER_SMIF0_TR_RX_REQ,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux17_sources[15] =
{
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ0,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO00,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO10,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ1,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO01,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO11,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ2,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO02,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO12,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ3,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO03,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO13,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ4,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO04,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO14,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux18_sources[6] =
{
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS2_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS2_TR_I2S_RX_REQ,
};

