RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7200.c
const _cyhal_trigger_source_xmc7200_t cyhal_mux21_sources[5] =
{
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT38,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT41,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT44,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT47,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT50,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux22_sources[5] =
{
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT32,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT35,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT38,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT41,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT44,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux23_sources[20] =
{
    _CYHAL_TRIGGER_TCPWM1_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT03,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT04,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT05,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT06,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT07,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT08,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT09,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT010,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT011,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT012,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT013,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT014,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT015,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT016,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT017,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT018,
    _CYHAL_TRIGGER_TCPWM1_TR_OUT019,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux24_sources[2] =
{
    _CYHAL_TRIGGER_FLEXRAY0_TR_IBF_OUT,
    _CYHAL_TRIGGER_FLEXRAY0_TR_OBF_OUT,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux25_sources[2] =
{
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT61,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT62,
};

const _cyhal_trigger_source_xmc7200_t cyhal_mux26_sources[2] =
{
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT63,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT64,
};

const _cyhal_trigger_source_xmc7200_t* cyhal_mux_to_sources[27] =
{
    cyhal_mux0_sources,
    cyhal_mux1_sources,
    cyhal_mux2_sources,
    cyhal_mux3_sources,
    cyhal_mux4_sources,
    cyhal_mux5_sources,
    cyhal_mux6_sources,
    cyhal_mux7_sources,
    cyhal_mux8_sources,
    cyhal_mux9_sources,
    cyhal_mux10_sources,
    cyhal_mux11_sources,
    cyhal_mux12_sources,
    cyhal_mux13_sources,
    cyhal_mux14_sources,
    cyhal_mux15_sources,
    cyhal_mux16_sources,
    cyhal_mux17_sources,
    cyhal_mux18_sources,
    cyhal_mux19_sources,
    cyhal_mux20_sources,
    cyhal_mux21_sources,
    cyhal_mux22_sources,
    cyhal_mux23_sources,
    cyhal_mux24_sources,
    cyhal_mux25_sources,
    cyhal_mux26_sources,
};

const uint8_t cyhal_dest_to_mux[543] =
{
    137, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK0 */
    137, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK1 */
    137, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK2 */
    137, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK3 */
    137, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK4 */
    136, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK0 */
    136, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK1 */
    136, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK2 */
    136, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK3 */
    136, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK4 */
    8, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN0 */
    8, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN1 */
    8, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN2 */
    8, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN3 */
    8, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN4 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN0 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN1 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN2 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN3 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN4 */
    9, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN0 */
    9, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN1 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN0 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN1 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN2 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN3 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN4 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN5 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN6 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN7 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN0 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN1 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN2 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN3 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN4 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN5 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN6 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN7 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN8 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN9 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN10 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN11 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN12 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN13 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN14 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN15 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN16 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN17 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN18 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN19 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN20 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN21 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN22 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN23 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN24 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN25 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN26 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN27 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN28 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN29 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN30 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN31 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN32 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN33 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN34 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN35 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN36 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN37 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN38 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN39 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN40 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN41 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN42 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN43 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN44 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN45 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN46 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN47 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN48 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN49 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN50 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN51 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN52 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN53 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN54 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN55 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN56 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN57 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN58 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN59 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN60 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN61 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN62 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN63 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN64 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN65 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN66 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN67 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN68 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN69 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN70 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN71 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN72 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN73 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN74 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN75 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN76 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN77 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN78 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN79 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN80 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN81 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN82 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN83 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN84 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN85 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN86 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN87 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN88 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN89 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN90 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN91 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN92 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN93 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN94 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN95 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN96 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN97 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN98 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN99 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN100 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN101 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN102 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN103 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN104 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN105 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN106 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN107 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN108 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN109 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN110 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN111 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN112 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN113 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN114 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN115 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN116 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN117 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN118 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN119 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN120 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN121 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN122 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN123 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN124 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN125 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN126 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN127 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN128 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN129 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN130 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN131 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN132 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN133 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN134 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN135 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN136 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN137 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN138 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN139 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN140 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN141 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN142 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN0 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN1 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN2 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN3 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN4 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN5 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN6 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN7 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN8 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN9 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN10 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN11 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN12 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN13 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN14 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN15 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN16 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN17 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN18 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN19 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN20 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN21 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN22 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN23 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN24 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN25 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN26 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN27 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN28 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN29 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN30 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN31 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN32 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN33 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN34 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN35 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN36 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN37 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN38 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN39 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN40 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN41 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN42 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN43 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN44 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN45 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN46 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN47 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN48 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN49 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN50 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN51 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN52 */
    131, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN53 */
    131, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN54 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN55 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN56 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN57 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN58 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN59 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN60 */
    139, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN61 */
    139, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN62 */
    140, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN63 */
    140, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN64 */
    141, /* CYHAL_TRIGGER_FLEXRAY0_TR_IBF_IN */
    141, /* CYHAL_TRIGGER_FLEXRAY0_TR_OBF_IN */
    8, /* CYHAL_TRIGGER_FLEXRAY0_TR_STPWT_IN */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER0 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER1 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER2 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER3 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER4 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER5 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER6 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER7 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER8 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER9 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER10 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER11 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER12 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER13 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER14 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER15 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER16 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER17 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER18 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER19 */
    9, /* CYHAL_TRIGGER_PASS0_TR_DEBUG_FREEZE */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN0 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN1 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN2 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN3 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN4 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN5 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN6 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN7 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN8 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN9 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN10 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN11 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN12 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN13 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN14 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN15 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN16 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN17 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN18 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN19 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN20 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN21 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN22 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN23 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN24 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN25 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN26 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN27 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN28 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN29 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN30 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN31 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN32 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN33 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN34 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN35 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN36 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN37 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN38 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN39 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN40 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN41 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN42 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN43 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN44 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN45 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN46 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN47 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN48 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN49 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN50 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN51 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN52 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN53 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN54 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN55 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN56 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN57 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN58 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN59 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN60 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN61 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN62 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN63 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN64 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN65 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN66 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN67 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN68 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN69 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN70 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN71 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN72 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN73 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN74 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN75 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN76 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN77 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN78 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN79 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN80 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN81 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN82 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN83 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN84 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN85 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN86 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN87 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN88 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN89 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN90 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN91 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN92 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN93 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN94 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN95 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN0 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN1 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN2 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN3 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN4 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN5 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN6 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN7 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN8 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN9 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN10 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN11 */
    9, /* CYHAL_TRIGGER_PERI_TR_DBG_FREEZE */
    9, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT0 */
    9, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT1 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT0 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT1 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT2 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_WDT */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN0 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN1 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN2 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN3 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN4 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN5 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN6 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN7 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN8 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN9 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN10 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN11 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN0 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN1 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN2 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN3 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN4 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN5 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN6 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN7 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN8 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN9 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN10 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN11 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN12 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN13 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN14 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN15 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN16 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN17 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN18 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN19 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN20 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN21 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN22 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN23 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN24 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN25 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN26 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN27 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN28 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN29 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN30 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN31 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN32 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN33 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN34 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN35 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN36 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN37 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN38 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN39 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN40 */
    9, /* CYHAL_TRIGGER_TCPWM0_TR_DEBUG_FREEZE */
    9, /* CYHAL_TRIGGER_TCPWM1_TR_DEBUG_FREEZE */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN2 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN5 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN8 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN11 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN14 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN17 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN20 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN23 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN26 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN29 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN32 */
