RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7200.c
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN35 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN38 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN41 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN44 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN47 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN50 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN53 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN56 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN59 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN62 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN65 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN68 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN71 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN74 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN77 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN80 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN83 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN86 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN89 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN92 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN95 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN98 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN101 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN104 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN107 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN110 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN113 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN116 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN119 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN122 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN125 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN128 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN131 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN134 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN137 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN140 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN143 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN146 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN149 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN152 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN155 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN158 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN161 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN164 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN167 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN170 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN173 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN176 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN179 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN182 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN185 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN188 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN191 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN194 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN197 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN200 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN203 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN206 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN209 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN212 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN215 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN218 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN221 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN224 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN227 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN230 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN233 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN236 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN239 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN242 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN245 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN248 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN251 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN770 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN773 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN776 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN779 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN782 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN785 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN788 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN791 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN794 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN797 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN800 */
    134, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN803 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT5 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT6 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT7 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT10 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT11 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT12 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT13 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT14 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT15 */
};

const uint8_t cyhal_mux_dest_index[543] =
{
    0, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK0 */
    1, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK1 */
    2, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK2 */
    3, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK3 */
    4, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK4 */
    0, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK0 */
    1, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK1 */
    2, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK2 */
    3, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK3 */
    4, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK4 */
    0, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN0 */
    1, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN1 */
    2, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN2 */
    3, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN3 */
    4, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN4 */
    5, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN0 */
    6, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN1 */
    7, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN2 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN3 */
    9, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN4 */
    2, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN0 */
    3, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN1 */
    0, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN0 */
    1, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN1 */
    2, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN2 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN3 */
    4, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN4 */
    5, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN5 */
    6, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN6 */
    7, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN7 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN0 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN1 */
    2, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN2 */
    3, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN3 */
    4, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN4 */
    5, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN5 */
    6, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN6 */
    7, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN7 */
    8, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN8 */
    9, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN9 */
    10, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN10 */
    11, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN11 */
    12, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN12 */
    13, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN13 */
    14, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN14 */
    15, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN15 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN16 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN17 */
    2, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN18 */
    3, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN19 */
    4, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN20 */
    5, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN21 */
    6, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN22 */
    7, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN23 */
    8, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN24 */
    9, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN25 */
    10, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN26 */
    11, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN27 */
    12, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN28 */
    13, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN29 */
    14, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN30 */
    15, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN31 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN32 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN33 */
    2, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN34 */
    3, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN35 */
    4, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN36 */
    5, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN37 */
    6, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN38 */
    7, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN39 */
    8, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN40 */
    9, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN41 */
    10, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN42 */
    11, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN43 */
    12, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN44 */
    13, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN45 */
    14, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN46 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN47 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN48 */
    2, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN49 */
    3, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN50 */
    4, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN51 */
    5, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN52 */
    6, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN53 */
    7, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN54 */
    8, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN55 */
    9, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN56 */
    10, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN57 */
    11, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN58 */
    12, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN59 */
    13, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN60 */
    14, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN61 */
    15, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN62 */
    16, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN63 */
    17, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN64 */
    18, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN65 */
    19, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN66 */
    20, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN67 */
    21, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN68 */
    22, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN69 */
    23, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN70 */
    24, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN71 */
    25, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN72 */
    26, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN73 */
    27, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN74 */
    28, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN75 */
    29, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN76 */
    30, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN77 */
    31, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN78 */
    32, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN79 */
    33, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN80 */
    34, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN81 */
    35, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN82 */
    36, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN83 */
    37, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN84 */
    38, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN85 */
    39, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN86 */
    40, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN87 */
    41, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN88 */
    42, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN89 */
    43, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN90 */
    44, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN91 */
    45, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN92 */
    46, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN93 */
    47, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN94 */
    48, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN95 */
    49, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN96 */
    50, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN97 */
    51, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN98 */
    52, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN99 */
    53, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN100 */
    54, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN101 */
    55, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN102 */
    56, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN103 */
    57, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN104 */
    58, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN105 */
    59, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN106 */
    60, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN107 */
    61, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN108 */
    62, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN109 */
    63, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN110 */
    64, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN111 */
    65, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN112 */
    66, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN113 */
    67, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN114 */
    68, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN115 */
    69, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN116 */
    70, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN117 */
    71, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN118 */
    72, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN119 */
    73, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN120 */
    74, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN121 */
    75, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN122 */
    76, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN123 */
    77, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN124 */
    78, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN125 */
    79, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN126 */
    80, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN127 */
    81, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN128 */
    82, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN129 */
    83, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN130 */
    84, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN131 */
    85, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN132 */
    86, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN133 */
    87, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN134 */
    88, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN135 */
    89, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN136 */
    90, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN137 */
    91, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN138 */
    92, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN139 */
    93, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN140 */
    94, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN141 */
    95, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN142 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN0 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN1 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN2 */
    3, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN3 */
    4, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN4 */
    5, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN5 */
    6, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN6 */
    7, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN7 */
    8, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN8 */
    9, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN9 */
    10, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN10 */
    11, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN11 */
    12, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN12 */
    13, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN13 */
    14, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN14 */
    15, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN15 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN16 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN17 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN18 */
    3, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN19 */
    4, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN20 */
    5, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN21 */
    6, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN22 */
    7, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN23 */
    8, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN24 */
    9, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN25 */
    10, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN26 */
    11, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN27 */
    12, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN28 */
    13, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN29 */
    14, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN30 */
    15, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN31 */
    16, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN32 */
    17, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN33 */
    18, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN34 */
    19, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN35 */
    20, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN36 */
    21, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN37 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN38 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN39 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN40 */
    3, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN41 */
    4, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN42 */
    5, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN43 */
    6, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN44 */
    7, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN45 */
    8, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN46 */
    9, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN47 */
    10, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN48 */
    11, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN49 */
    12, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN50 */
    13, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN51 */
    14, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN52 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN53 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN54 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN55 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN56 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN57 */
    3, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN58 */
    4, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN59 */
    5, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN60 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN61 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN62 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN63 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN64 */
    0, /* CYHAL_TRIGGER_FLEXRAY0_TR_IBF_IN */
    1, /* CYHAL_TRIGGER_FLEXRAY0_TR_OBF_IN */
    10, /* CYHAL_TRIGGER_FLEXRAY0_TR_STPWT_IN */
    0, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER0 */
    1, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER1 */
    2, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER2 */
    3, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER3 */
    4, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER4 */
    5, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER5 */
    6, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER6 */
    7, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER7 */
    8, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER8 */
    9, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER9 */
    10, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER10 */
    11, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER11 */
    12, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER12 */
    13, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER13 */
    14, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER14 */
    15, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER15 */
    16, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER16 */
    17, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER17 */
    18, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER18 */
    19, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER19 */
    5, /* CYHAL_TRIGGER_PASS0_TR_DEBUG_FREEZE */
    0, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN0 */
    1, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN1 */
    2, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN2 */
    3, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN3 */
    4, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN4 */
    5, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN5 */
    6, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN6 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN7 */
    8, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN8 */
    9, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN9 */
    10, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN10 */
    11, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN11 */
    12, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN12 */
    13, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN13 */
    14, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN14 */
    15, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN15 */
    16, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN16 */
    17, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN17 */
    18, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN18 */
    19, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN19 */
    20, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN20 */
    21, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN21 */
    22, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN22 */
    23, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN23 */
    24, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN24 */
    25, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN25 */
    26, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN26 */
    27, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN27 */
    28, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN28 */
    29, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN29 */
    30, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN30 */
    31, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN31 */
    32, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN32 */
    33, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN33 */
    34, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN34 */
    35, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN35 */
    36, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN36 */
    37, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN37 */
    38, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN38 */
    39, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN39 */
    40, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN40 */
    41, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN41 */
    42, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN42 */
    43, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN43 */
    44, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN44 */
    45, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN45 */
    46, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN46 */
    47, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN47 */
    48, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN48 */
    49, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN49 */
    50, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN50 */
    51, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN51 */
    52, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN52 */
    53, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN53 */
    54, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN54 */
    55, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN55 */
    56, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN56 */
    57, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN57 */
    58, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN58 */
    59, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN59 */
    60, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN60 */
    61, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN61 */
    62, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN62 */
    63, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN63 */
    64, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN64 */
    65, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN65 */
    66, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN66 */
    67, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN67 */
    68, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN68 */
    69, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN69 */
    70, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN70 */
    71, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN71 */
    72, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN72 */
    73, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN73 */
    74, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN74 */
    75, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN75 */
    76, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN76 */
    77, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN77 */
    78, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN78 */
    79, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN79 */
    80, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN80 */
    81, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN81 */
    82, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN82 */
    83, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN83 */
    84, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN84 */
    85, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN85 */
    86, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN86 */
    87, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN87 */
    88, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN88 */
    89, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN89 */
    90, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN90 */
    91, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN91 */
    92, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN92 */
    93, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN93 */
    94, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN94 */
    95, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN95 */
    0, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN0 */
    1, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN1 */
    2, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN2 */
    3, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN3 */
    4, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN4 */
    5, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN5 */
    6, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN6 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN7 */
    8, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN8 */
    9, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN9 */
    10, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN10 */
    11, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN11 */
    4, /* CYHAL_TRIGGER_PERI_TR_DBG_FREEZE */
    0, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT0 */
    1, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT1 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT0 */
    8, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT1 */
    7, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT2 */
    6, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_WDT */
    0, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN0 */
    1, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN1 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN2 */
    3, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN3 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN4 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN5 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN6 */
    7, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN7 */
    8, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN8 */
    9, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN9 */
    10, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN10 */
    11, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN11 */
    0, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN0 */
    1, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN1 */
    2, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN2 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN3 */
    4, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN4 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN5 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN6 */
    7, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN7 */
