RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7200.c
    8, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN8 */
    9, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN9 */
    10, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN10 */
    11, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN11 */
    0, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN12 */
    1, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN13 */
    2, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN14 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN15 */
    4, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN16 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN17 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN18 */
    7, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN19 */
    8, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN20 */
    9, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN21 */
    10, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN22 */
    11, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN23 */
    12, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN24 */
    13, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN25 */
    14, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN26 */
    15, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN27 */
    16, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN28 */
    17, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN29 */
    18, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN30 */
    19, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN31 */
    20, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN32 */
    21, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN33 */
    22, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN34 */
    23, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN35 */
    24, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN36 */
    25, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN37 */
    26, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN38 */
    27, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN39 */
    28, /* CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN40 */
    10, /* CYHAL_TRIGGER_TCPWM0_TR_DEBUG_FREEZE */
    11, /* CYHAL_TRIGGER_TCPWM1_TR_DEBUG_FREEZE */
    4, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN2 */
    5, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN5 */
    6, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN8 */
    7, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN11 */
    8, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN14 */
    9, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN17 */
    10, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN20 */
    11, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN23 */
    12, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN26 */
    13, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN29 */
    14, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN32 */
    15, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN35 */
    16, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN38 */
    17, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN41 */
    18, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN44 */
    19, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN47 */
    20, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN50 */
    21, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN53 */
    22, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN56 */
    23, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN59 */
    24, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN62 */
    25, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN65 */
    26, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN68 */
    27, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN71 */
    28, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN74 */
    29, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN77 */
    30, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN80 */
    31, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN83 */
    36, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN86 */
    37, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN89 */
    38, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN92 */
    39, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN95 */
    40, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN98 */
    41, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN101 */
    42, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN104 */
    43, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN107 */
    44, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN110 */
    45, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN113 */
    46, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN116 */
    47, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN119 */
    48, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN122 */
    49, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN125 */
    50, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN128 */
    51, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN131 */
    52, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN134 */
    53, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN137 */
    54, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN140 */
    55, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN143 */
    56, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN146 */
    57, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN149 */
    58, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN152 */
    59, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN155 */
    60, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN158 */
    61, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN161 */
    62, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN164 */
    63, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN167 */
    68, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN170 */
    69, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN173 */
    70, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN176 */
    71, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN179 */
    72, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN182 */
    73, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN185 */
    74, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN188 */
    75, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN191 */
    76, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN194 */
    77, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN197 */
    78, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN200 */
    79, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN203 */
    80, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN206 */
    81, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN209 */
    82, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN212 */
    83, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN215 */
    84, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN218 */
    85, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN221 */
    86, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN224 */
    87, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN227 */
    88, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN230 */
    89, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN233 */
    90, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN236 */
    91, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN239 */
    92, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN242 */
    93, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN245 */
    94, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN248 */
    95, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN251 */
    0, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN770 */
    32, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN773 */
    64, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN776 */
    1, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN779 */
    33, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN782 */
    65, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN785 */
    2, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN788 */
    34, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN791 */
    66, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN794 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN797 */
    35, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN800 */
    67, /* CYHAL_TRIGGER_TCPWM1_TR_ONE_CNT_IN803 */
    0, /* CYHAL_TRIGGER_TR_GROUP9_INPUT1 */
    1, /* CYHAL_TRIGGER_TR_GROUP9_INPUT2 */
    2, /* CYHAL_TRIGGER_TR_GROUP9_INPUT3 */
    3, /* CYHAL_TRIGGER_TR_GROUP9_INPUT4 */
    4, /* CYHAL_TRIGGER_TR_GROUP9_INPUT5 */
    0, /* CYHAL_TRIGGER_TR_GROUP9_INPUT6 */
    1, /* CYHAL_TRIGGER_TR_GROUP9_INPUT7 */
    2, /* CYHAL_TRIGGER_TR_GROUP9_INPUT8 */
    3, /* CYHAL_TRIGGER_TR_GROUP9_INPUT9 */
    4, /* CYHAL_TRIGGER_TR_GROUP9_INPUT10 */
    0, /* CYHAL_TRIGGER_TR_GROUP9_INPUT11 */
    1, /* CYHAL_TRIGGER_TR_GROUP9_INPUT12 */
    2, /* CYHAL_TRIGGER_TR_GROUP9_INPUT13 */
    3, /* CYHAL_TRIGGER_TR_GROUP9_INPUT14 */
    4, /* CYHAL_TRIGGER_TR_GROUP9_INPUT15 */
};

#endif /* CY_DEVICE_TVIIBH8M */
